#+TITLE: My Emacs Org-Mode Document
#+DATE: <2020-08-28 10:31:10>
#+TAGS[]: emacs, org-mode
#+CATEGORIES[]: emacs
#+LANGUAGE: zh-cn
#+STARTUP: indent align

*** :op

没有指定 :op 的时候默认是 ~:op send~

#+begin_tip
@@html:<p><strong>TIP</strong></p>@@

可以使用 :var keyword 来给 verb src block 传递参数，然后在代码块中用

~(verb-var <variable-name>)~ 使用。
#+end_tip

1. ~:op send get-headers~: 只显示响应头信息。
   #+begin_src verb :wrap src ob-verb-response :op send get-headers
    get https://api.ipify.org?format=json
   #+end_src

   #+RESULTS:
   #+begin_src ob-verb-response
   Server: Cowboy
   Connection: keep-alive
   Content-Type: application/json
   Vary: Origin
   Date: Sat, 24 Jul 2021 11:11:31 GMT
   Content-Length: 22
   Via: 1.1 vegur
   #+end_src

2. ~:op send get-body~: 只显示响应体信息。

   #+begin_src verb :wrap src ob-verb-response :op send get-body
    get https://api.ipify.org?format=json
   #+end_src

   #+RESULTS:
   #+begin_src ob-verb-response
   {
     "ip": "27.38.254.246"
   }
   #+end_src

3. ~:op export curl~ 将请求导出为 CURL 格式。

   #+begin_src verb :op export curl
    get https://api.ipify.org?format=json
   #+end_src

   #+RESULTS:
   : curl 'https://api.ipify.org/?format=json'

4. ~:op export verb~ 将请求导出为 verb 格式。

   #+begin_src verb :op export verb
    get https://api.ipify.org?format=json
   #+end_src

   #+RESULTS:
   : GET https://api.ipify.org/?format=json
